In [1]:
import pandas as pd

In [87]:
assessments = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-ro-a/product/8lesson/assessments.csv')

In [56]:
courses = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-ro-a/product/8lesson/courses.csv')

In [92]:
studentAssessment = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-ro-a/product/8lesson/studentAssessment.csv')

In [15]:
studreg = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-ro-a/product/8lesson/studentRegistration.csv')

In [90]:
asss = studass.merge(assessments.query('assessment_type == "Exam"'), on='id_assessment', how='inner').query('score >= 40')

In [97]:
# Задача 1:
# Сколько студентов успешно сдали только один курс?
# 1. Из studentAssessment выделить толлько те, которые сданы успешно, т.е. набрали 40+ баллов
# 2. Приджойнить к studentAssessment типы ассессментов из файла assessments
# 3. Отфильтровать только те ассесменты, которые относятся к типу Exam 
# 4. Посчитать количество уникальных успешно сданных экзаменов для каждого студента с помощью groupby
# 5. Посчитать количество студентов, у которых успешно сдан только 1 экзамен

task_1 = (
    studentAssessment.query('score > 39')
    .merge(
        assessments.query('assessment_type == "Exam"')[['id_assessment']].drop_duplicates(),
        on='id_assessment',
        how='inner'
    )
    .groupby('id_student', as_index=False)['id_assessment']
    .nunique()
    .rename(columns={'id_assessment': 'successes_count'})
)

# Подсчёт студентов с единственным успешным экзаменом
task_1 = task_1[task_1['successes_count'] == 1]['id_student'].nunique()

print(task_1)

3802

In [118]:
unfolow = studreg.sort_values('date_unregistration', ascending=False).dropna()

In [120]:
unfolow.groupby('code_module').agg({'date_unregistration':'count'}).sort_values('date_unregistration', ascending=False)

             date_unregistration
code_module
FFF                         2370
BBB                         2369
DDD                         2223
CCC                         1940
EEE                          716
GGG                          289
AAA                          126

In [173]:
recency = pd.merge(assessments, studentAssessment, on='id_assessment')\
.query('assessment_type =="Exam"')\
.groupby('id_student', as_index=False)['date_submitted'].mean()\
.sort_values('date_submitted', ascending=False)

In [180]:
recency

      id_student  date_submitted
1707      555498           285.0
4374     2341830           279.0
1704      555008           266.0
532       352637           259.0
4037      695916           256.0
...          ...             ...
1575      546953           229.0
80         86047           229.0
4379     2348111           229.0
1572      546830           229.0
1586      548069           229.0

[4633 rows x 2 columns]

In [214]:
frequency = pd.merge(assessments, studentAssessment, on='id_assessment')\
.query('assessment_type =="Exam"')\
.groupby('id_assessment', as_index=False)['date'].mean()\
.sort_values('date', ascending=True)

In [215]:
frequency

   id_assessment   date
2          25340  240.0
4          25361  241.0
3          25354  261.0
0          24290    NaN
1          24299    NaN
5          25368    NaN

In [168]:
money = pd.merge(assessments, studentAssessment, on='id_assessment')\
.query('assessment_type =="Exam"')\
.groupby('id_student', as_index=False)['score'].mean()\
.sort_values('score', ascending=False)

In [181]:
money

      id_student  score
3599      652902  100.0
3228      631473  100.0
2309      588274  100.0
3101      627401  100.0
4290     2131908  100.0
...          ...    ...
492       338034    7.0
4529     2588543    4.0
1736      556660    0.0
137       131152    0.0
75         81351    0.0

[4633 rows x 2 columns]

In [198]:
rfm = pd.concat([recency, frequency, money], axis=1)
rfm.head()

   id_student  date_submitted  id_student   date  id_student  score
0       23698           243.0       23698    NaN       23698   80.0
1       24213           236.0       24213  241.0       24213   58.0
2       27116           243.0       27116    NaN       27116   96.0
3       28046           237.0       28046  261.0       28046   40.0
4       28787           243.0       28787    NaN       28787   44.0

In [203]:
rfm['R'] = pd.qcut(rfm['date_submitted'], 3, lables = [3,2,1])
rfm['F'] = pd.qcut(rfm['date'], 3, lables = [1,2,3])
rfm['M'] = pd.qcut(rfm['money'], 3, lables = [1,2,3])

TypeError: qcut() got an unexpected keyword argument 'lables'

In [202]:
rfm['RFM_Score'] = rmf['R'].astype(str) + rmf['F'].astype(str) +rmf['M'].astype(str)

NameError: name 'rmf' is not defined

In [ ]:
rfm['M']